---
kind: type
id: T:Autodesk.Revit.DB.Structure.MemberForcesServiceData
source: html/67d4a404-89bb-7d7e-3198-dd6fd596dcf1.htm
---
# Autodesk.Revit.DB.Structure.MemberForcesServiceData

The data needed by member forces server to perform type definition.

## Syntax (C#)
```csharp
public class MemberForcesServiceData : IDisposable
```